# combining_reshaping_data

# Merging and joining Data Frames

In [1]:
import pandas as pd
import numpy as np
import datetime 
customers={'customer_id':[1234,1235,1111,2222,3334,3333,4444,5555],
             'Name':['Mike', 'Maria', 'Nasir', 'Ali',"Ahmed", 'Saad',"Hamid", "Kami"],
             'Address':['abc23-1', 'xyz-3','abc23-2', 'xyz-5','abc23-6', 'xyz-0','abc23-11', 'xyz-301'],
             }
customers=pd.DataFrame(customers)
customers

   customer_id   Name   Address
0         1234   Mike   abc23-1
1         1235  Maria     xyz-3
2         1111  Nasir   abc23-2
3         2222    Ali     xyz-5
4         3334  Ahmed   abc23-6
5         3333   Saad     xyz-0
6         4444  Hamid  abc23-11
7         5555   Kami   xyz-301

In [2]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  8 non-null      int64
 1   Name         8 non-null      object
 2   Address      8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [3]:
#customers.set_index('Customer_id')

In [4]:
orders={
    'customer_id':[1234,1235,1234,1234,1235,1267,1237,1890],
          'order_id':[11,22,33,44,55,66,77,88],
         'order_date':[datetime.date(2023,2,1),datetime.date(2023,1,1),
                       datetime.date(2023,2,2),datetime.date(2023,1,1),
                       datetime.date(2023,2,3),datetime.date(2023,1,2),
                       datetime.date(2023,2,4),datetime.date(2023,1,2)],
}

In [5]:
orders=pd.DataFrame(orders)
orders

   customer_id  order_id  order_date
0         1234        11  2023-02-01
1         1235        22  2023-01-01
2         1234        33  2023-02-02
3         1234        44  2023-01-01
4         1235        55  2023-02-03
5         1267        66  2023-01-02
6         1237        77  2023-02-04
7         1890        88  2023-01-02

In [6]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  8 non-null      int64
 1   order_id     8 non-null      int64
 2   order_date   8 non-null      object
dtypes: int64(2), object(1)
memory usage: 320.0+ bytes

# Merge Data
-Inner
-Outer
-Left
-Right

In [7]:
#inner merge >> intersection
merged_data=pd.merge(customers,orders)

In [8]:
merged_data.sort_values(by='customer_id',ascending=False)

   customer_id   Name  Address  order_id  order_date
3         1235  Maria    xyz-3        22  2023-01-01
4         1235  Maria    xyz-3        55  2023-02-03
0         1234   Mike  abc23-1        11  2023-02-01
1         1234   Mike  abc23-1        33  2023-02-02
2         1234   Mike  abc23-1        44  2023-01-01

In [9]:
merged_data=pd.merge(orders,customers)

In [10]:
merged_data

   customer_id  order_id  order_date   Name  Address
0         1234        11  2023-02-01   Mike  abc23-1
1         1234        33  2023-02-02   Mike  abc23-1
2         1234        44  2023-01-01   Mike  abc23-1
3         1235        22  2023-01-01  Maria    xyz-3
4         1235        55  2023-02-03  Maria    xyz-3

In [11]:
#how 
merged_data=pd.merge(orders,customers,how='inner')
merged_data

   customer_id  order_id  order_date   Name  Address
0         1234        11  2023-02-01   Mike  abc23-1
1         1234        33  2023-02-02   Mike  abc23-1
2         1234        44  2023-01-01   Mike  abc23-1
3         1235        22  2023-01-01  Maria    xyz-3
4         1235        55  2023-02-03  Maria    xyz-3

In [12]:
merged_data=pd.merge(customers,orders, how='outer') #outer merge

In [13]:
merged_data

    customer_id   Name   Address  order_id  order_date
0          1234   Mike   abc23-1      11.0  2023-02-01
1          1234   Mike   abc23-1      33.0  2023-02-02
2          1234   Mike   abc23-1      44.0  2023-01-01
3          1235  Maria     xyz-3      22.0  2023-01-01
4          1235  Maria     xyz-3      55.0  2023-02-03
5          1111  Nasir   abc23-2       NaN         NaN
6          2222    Ali     xyz-5       NaN         NaN
7          3334  Ahmed   abc23-6       NaN         NaN
8          3333   Saad     xyz-0       NaN         NaN
9          4444  Hamid  abc23-11       NaN         NaN
10         5555   Kami   xyz-301       NaN         NaN
11         1267    NaN       NaN      66.0  2023-01-02
12         1237    NaN       NaN      77.0  2023-02-04
13         1890    NaN       NaN      88.0  2023-01-02

In [14]:
merged_data=pd.merge(customers,orders, how='left')
merged_data

    customer_id   Name   Address  order_id  order_date
0          1234   Mike   abc23-1      11.0  2023-02-01
1          1234   Mike   abc23-1      33.0  2023-02-02
2          1234   Mike   abc23-1      44.0  2023-01-01
3          1235  Maria     xyz-3      22.0  2023-01-01
4          1235  Maria     xyz-3      55.0  2023-02-03
5          1111  Nasir   abc23-2       NaN         NaN
6          2222    Ali     xyz-5       NaN         NaN
7          3334  Ahmed   abc23-6       NaN         NaN
8          3333   Saad     xyz-0       NaN         NaN
9          4444  Hamid  abc23-11       NaN         NaN
10         5555   Kami   xyz-301       NaN         NaN

In [15]:
merged_data=pd.merge(customers,orders, how='right')
merged_data

   customer_id   Name  Address  order_id  order_date
0         1234   Mike  abc23-1        11  2023-02-01
1         1235  Maria    xyz-3        22  2023-01-01
2         1234   Mike  abc23-1        33  2023-02-02
3         1234   Mike  abc23-1        44  2023-01-01
4         1235  Maria    xyz-3        55  2023-02-03
5         1267    NaN      NaN        66  2023-01-02
6         1237    NaN      NaN        77  2023-02-04
7         1890    NaN      NaN        88  2023-01-02

In [16]:
df1 = pd.DataFrame({'left': ['foo', 'bar']})
df2 = pd.DataFrame({'right': [7, 8]})
df = pd.merge(df1,df2, how='cross')
df

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

In [17]:
df1 = pd.DataFrame({'key':[1,1],'left': ['foo', 'bar']})
df2 = pd.DataFrame({'key':[1,1],'right': [7, 8]})
df = pd.merge(df1,df2, how='cross')[['left','right']]
df

  left  right
0  foo      7
1  foo      8
2  bar      7
3  bar      8

In [18]:
pd.__version__

'1.4.4'

In [19]:
customers={'customerID':[1234,1235,1111,2222,3334,3333,4444,5555],
             'Name':['Mike', 'Maria', 'Nasir', 'Ali',"Ahmed", 'Saad',"Hamid", "Kami"],
             'Address':['abc23-1', 'xyz-3','abc23-2', 'xyz-5','abc23-6', 'xyz-0','abc23-11', 'xyz-301'],
             }

In [20]:
customers=pd.DataFrame(customers)
customers

   customerID   Name   Address
0        1234   Mike   abc23-1
1        1235  Maria     xyz-3
2        1111  Nasir   abc23-2
3        2222    Ali     xyz-5
4        3334  Ahmed   abc23-6
5        3333   Saad     xyz-0
6        4444  Hamid  abc23-11
7        5555   Kami   xyz-301

In [21]:
orders={'customer_id':[1234,1235,1234,1234,1235,1267,1237,1890],
          'order_id':[11,22,33,44,55,66,77,88],
         'order_date':[datetime.date(2023,2,1),datetime.date(2023,1,1),
                       datetime.date(2023,2,2),datetime.date(2023,1,1),
                       datetime.date(2023,2,3),datetime.date(2023,1,2),
                       datetime.date(2023,2,4),datetime.date(2023,1,2)],
         }
orders=pd.DataFrame(orders)
orders

   customer_id  order_id  order_date
0         1234        11  2023-02-01
1         1235        22  2023-01-01
2         1234        33  2023-02-02
3         1234        44  2023-01-01
4         1235        55  2023-02-03
5         1267        66  2023-01-02
6         1237        77  2023-02-04
7         1890        88  2023-01-02

In [22]:
"""merged=pd.merge(customers,orders)
"""
# No common columns to perform merge on. 
# Merge options: left_on=None, right_on=None, 
# left_index=False, right_index=False

'merged=pd.merge(customers,orders)\n'

In [23]:
customers  = {'customerID':[1234,1235,1111,2222,3334,3333,4444,5555],
             'Name':['Mike', 'Maria', 'Nasir', 'Ali',"Ahmed", 'Saad',"Hamid", "Kami"],
             'Address':['abc23-1', 'xyz-3','abc23-2', 'xyz-5','abc23-6', 'xyz-0','abc23-11', 'xyz-301'],
              'order_date':[datetime.date(2023,2,1),datetime.date(2023,1,1),
                       datetime.date(2023,2,2),datetime.date(2023,1,1),
                       datetime.date(2023,2,3),datetime.date(2023,1,2),
                       datetime.date(2023,2,4),datetime.date(2023,1,2)]
             }

customers = pd.DataFrame(customers)

orders = {'customerID':[1234,1235,1234,1234,1235,1267,1237,1890],
          'order_id':[11,22,33,44,55,66,77,88],
         'order_date':[datetime.date(2023,2,1),datetime.date(2023,1,1),
                       datetime.date(2023,2,2),datetime.date(2023,1,1),
                       datetime.date(2023,2,3),datetime.date(2023,1,2),
                       datetime.date(2023,2,4),datetime.date(2023,1,2)],
         }

orders = pd.DataFrame(orders)

In [24]:
customers

   customerID   Name   Address  order_date
0        1234   Mike   abc23-1  2023-02-01
1        1235  Maria     xyz-3  2023-01-01
2        1111  Nasir   abc23-2  2023-02-02
3        2222    Ali     xyz-5  2023-01-01
4        3334  Ahmed   abc23-6  2023-02-03
5        3333   Saad     xyz-0  2023-01-02
6        4444  Hamid  abc23-11  2023-02-04
7        5555   Kami   xyz-301  2023-01-02

In [25]:
orders

   customerID  order_id  order_date
0        1234        11  2023-02-01
1        1235        22  2023-01-01
2        1234        33  2023-02-02
3        1234        44  2023-01-01
4        1235        55  2023-02-03
5        1267        66  2023-01-02
6        1237        77  2023-02-04
7        1890        88  2023-01-02

In [26]:
df_merged=pd.merge(customers,orders)
df_merged

   customerID   Name  Address  order_date  order_id
0        1234   Mike  abc23-1  2023-02-01        11
1        1235  Maria    xyz-3  2023-01-01        22

In [27]:
df_merged=pd.merge(customers,orders, on='order_date', suffixes=('left', '_right'))
df_merged

    customerIDleft   Name   Address  order_date  customerID_right  order_id
0             1234   Mike   abc23-1  2023-02-01              1234        11
1             1235  Maria     xyz-3  2023-01-01              1235        22
2             1235  Maria     xyz-3  2023-01-01              1234        44
3             2222    Ali     xyz-5  2023-01-01              1235        22
4             2222    Ali     xyz-5  2023-01-01              1234        44
5             1111  Nasir   abc23-2  2023-02-02              1234        33
6             3334  Ahmed   abc23-6  2023-02-03              1235        55
7             3333   Saad     xyz-0  2023-01-02              1267        66
8             3333   Saad     xyz-0  2023-01-02              1890        88
9             5555   Kami   xyz-301  2023-01-02              1267        66
10            5555   Kami   xyz-301  2023-01-02              1890        88
11            4444  Hamid  abc23-11  2023-02-04              1237        77

In [29]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two','two'],
                  'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                  'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [30]:
df.pivot(index='foo', columns='bar')

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [31]:
df.T

       0    1    2    3    4    5
foo  one  one  one  two  two  two
bar    A    B    C    A    B    C
baz    1    2    3    4    5    6
zoo    x    y    z    q    w    t